src/cf/InformationRegisters/ШаблоныДляСозданияДокументовПоВходящимЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныДляСозданияДокументовПоВходящимЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ШаблоныДляСозданияДокументовПоВходящимЭДО/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Записывает шаблоны для ручного создания в РС
//
// Параметры:
//  Получатель				 - СправочникСсылка.Организации
//  Отправитель				 - СправочникСсылка.Контрагенты
//  ИдентификаторПолучателя	 - Строка
//  ИдентификаторОтправителя - Строка
//  ВидДокумента			 - СправочникСсылка.ВидыДокументовЭДО
//  Шаблоны					 - ТаблицаЗначений - поля:
//   * ШаблонДокумента - СправочникСсылка.ШаблоныДокументов
//   * ТематикаДокумента - СправочникСсылка.ТематикиДокументов
//
Процедура ЗаписатьШаблоныДляСозданияДокументовПоВходящимЭДО(Получатель, Отправитель, ИдентификаторПолучателя, 
	ИдентификаторОтправителя, ВидДокумента, Шаблоны) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Получатель.Установить(Получатель);
	НаборЗаписей.Отбор.Отправитель.Установить(Отправитель);
	НаборЗаписей.Отбор.ИдентификаторПолучателя.Установить(ИдентификаторПолучателя);
	НаборЗаписей.Отбор.ИдентификаторОтправителя.Установить(ИдентификаторОтправителя);
	НаборЗаписей.Отбор.ВидЭДО.Установить(ВидДокумента);
	
	Для Каждого СтрокаШаблон Из Шаблоны Цикл
		
		ЗаписьШаблон = НаборЗаписей.Добавить();
		ЗаписьШаблон.ВидЭДО = ВидДокумента;
		ЗаписьШаблон.Получатель = Получатель;
		ЗаписьШаблон.Отправитель = Отправитель;
		ЗаписьШаблон.ИдентификаторПолучателя = ИдентификаторПолучателя;
		ЗаписьШаблон.ИдентификаторОтправителя = ИдентификаторОтправителя;
		ЗаписьШаблон.Шаблон = СтрокаШаблон.ШаблонДокумента;
		ЗаписьШаблон.Тематика = СтрокаШаблон.ТематикаДокумента;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
